package com.fedotova.studentplanner.data

data class ScheduleItem(
    val id: String,
    val dayOfWeek: String,
    val time: String,
    val timeRange: String,
    val subjectName: String,
    val teacher: String,
    val type: String
)

val sampleSchedule = listOf(
    ScheduleItem("1", "Вторник", "2 пара", "10:10-11:40", "Системное программирование", "Токаев Т.И.", "лекция"),
    ScheduleItem("2", "Вторник", "3 пара", "12:10-13:40", "Системное программирование", "Токаев Т.И.", "лабораторная"),
    ScheduleItem("3", "Вторник", "4 пара", "13:50-15:20", "Инструментальные средства разработки ПО", "Леонтьев Д.А.", "лабораторная"),
    ScheduleItem("4", "Вторник", "5 пара", "15:30-17:00", "Системное программирование", "Токаев Т.И.", "лабораторная"),

    ScheduleItem("5", "Среда", "1 пара", "8:30-10:00", "Разработка мобильных приложений", "Леонтьев Д.А.", "лабораторная"),
    ScheduleItem("6", "Среда", "2 пара", "10:10-11:40", "Разработка программных модулей", "Донскова Д.А.", "лабораторная"),
    ScheduleItem("7", "Среда", "3 пара", "12:10-13:40", "Разработка программных модулей", "Донскова Д.А.", "лекция"),

    ScheduleItem("8", "Четверг", "1 пара", "8:30-10:00", "Обеспечение качества функционирования КС", "Ушакова М.А.", "лекция"),
    ScheduleItem("9", "Четверг", "2 пара", "10:10-11:40", "Менеджмент", "Запорожская С.А.", "лабораторная"),
    ScheduleItem("10", "Четверг", "3 пара", "12:10-13:40", "Иностранный язык", "Пенькова О.В.", "практика"),
    ScheduleItem("11", "Четверг", "4 пара", "13:50-15:20", "Математическое моделирование", "Трошина О.В.", "практика"),

    ScheduleItem("12", "Пятница", "1 пара", "8:30-10:00", "Инструментальные средства разработки ПО", "Леонтьев Д.А.", "лабораторная"),
    ScheduleItem("13", "Пятница", "2 пара", "10:10-11:40", "Управление проектами", "Трошина О.В.", "лабораторная"),
    ScheduleItem("14", "Пятница", "3 пара", "12:10-13:40", "Управление проектами", "Трошина О.В.", "лабораторная")
)